In [1]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
data = pd.Series( [56,78,99,56,88,59,100,57,91], index=[['Team1', 'Team1', 'Team1', 'Team2', 'Team2', 'Team2','Team3', 'Team3', 'Team3'],['player_1', 'player_2', 'player_3','player_1', 'player_2', 'player_3','player_1', 'player_2','player_3']],name="Player's Score")
data

Team1  player_1     56
       player_2     78
       player_3     99
Team2  player_1     56
       player_2     88
       player_3     59
Team3  player_1    100
       player_2     57
       player_3     91
Name: Player's Score, dtype: int64

In [3]:
data.index

MultiIndex([('Team1', 'player_1'),
            ('Team1', 'player_2'),
            ('Team1', 'player_3'),
            ('Team2', 'player_1'),
            ('Team2', 'player_2'),
            ('Team2', 'player_3'),
            ('Team3', 'player_1'),
            ('Team3', 'player_2'),
            ('Team3', 'player_3')],
           )

In [4]:
data['Team1':'Team2']

Team1  player_1    56
       player_2    78
       player_3    99
Team2  player_1    56
       player_2    88
       player_3    59
Name: Player's Score, dtype: int64

In [5]:
data.loc[:, 'player_1']

Team1     56
Team2     56
Team3    100
Name: Player's Score, dtype: int64

In [6]:
data.loc['Team1', 'player_2']

78

In [7]:
df = {'name' :['Jack', 'Fatima', 'Salman', 'Sahil', 'Noureen', 'Hamza'],'rank' :[1, 2, 1, 2, 1, 2],'city' :['Khi', 'Khi', 'Isb', 'Isb', 'Lhr', 'Lhr'],'CS_rating' : [21, 56, 34, 45, 24, 34],'Maths_rating' : [76, 45, 56, 34, 234, 45]}
df = pd.DataFrame(df)
df

      name  rank city  CS_rating  Maths_rating
0     Jack     1  Khi         21            76
1   Fatima     2  Khi         56            45
2   Salman     1  Isb         34            56
3    Sahil     2  Isb         45            34
4  Noureen     1  Lhr         24           234
5    Hamza     2  Lhr         34            45

In [8]:
df.set_index(['city', 'rank'], inplace=True)
df

              name  CS_rating  Maths_rating
city rank
Khi  1        Jack         21            76
     2      Fatima         56            45
Isb  1      Salman         34            56
     2       Sahil         45            34
Lhr  1     Noureen         24           234
     2       Hamza         34            45

In [9]:
df.index

MultiIndex([('Khi', 1),
            ('Khi', 2),
            ('Isb', 1),
            ('Isb', 2),
            ('Lhr', 1),
            ('Lhr', 2)],
           names=['city', 'rank'])

In [10]:
df.loc['Khi', 1]

name            Jack
CS_rating         21
Maths_rating      76
Name: (Khi, 1), dtype: object

In [11]:
df.unstack()

         name         CS_rating     Maths_rating
rank        1       2         1   2            1   2
city
Isb    Salman   Sahil        34  45           56  34
Khi      Jack  Fatima        21  56           76  45
Lhr   Noureen   Hamza        24  34          234  45

In [12]:
df.stack()

city  rank
Khi   1     name               Jack
            CS_rating            21
            Maths_rating         76
      2     name             Fatima
            CS_rating            56
            Maths_rating         45
Isb   1     name             Salman
            CS_rating            34
            Maths_rating         56
      2     name              Sahil
            CS_rating            45
            Maths_rating         34
Lhr   1     name            Noureen
            CS_rating            24
            Maths_rating        234
      2     name              Hamza
            CS_rating            34
            Maths_rating         45
dtype: object

In [13]:
df.sort_index(level=0)

              name  CS_rating  Maths_rating
city rank
Isb  1      Salman         34            56
     2       Sahil         45            34
Khi  1        Jack         21            76
     2      Fatima         56            45
Lhr  1     Noureen         24           234
     2       Hamza         34            45

In [14]:
df.sort_index(level=1)

              name  CS_rating  Maths_rating
city rank
Isb  1      Salman         34            56
Khi  1        Jack         21            76
Lhr  1     Noureen         24           234
Isb  2       Sahil         45            34
Khi  2      Fatima         56            45
Lhr  2       Hamza         34            45